#include <iostream>
#include "Vector.h"

using namespace std;

/*
1. Перевантажити операції <, >, =<, => (порівняння векторів за довжиною), + (приєднання другого вектора
до першого), відсортувати масив екземплярів класу векторів за зростанням довжин з
використанням алгоритму сортування обміном, обчислити середню довжину для векторів у
масиві.
*/

int main()
{
	Vector v1(1, 1);
	Vector v2(2, 2);

	cout << "Comparison v1 < v2: " << (v1 < v2) << endl;
	cout << "Comparison v2 < v1: " << (v2 < v1) << endl;

	cout << "v[1] = " << v1[1] << endl;
	cout << "v[2] = " << v1[2] << endl;

	v1[1] = 3;
	v1[2] = 4;

	cout << "v[1] = " << v1[1] << endl;
	cout << "v[2] = " << v1[2] << endl;

	system("pause");
	return 0;
}